Derpythederp/3.007-DTI-Cube/proto_4/esp32_board1/DAC_Audio.cpp
// File: XT_DAC_Audio.cpp
// Description: XTronical DAC Audio Library, currently supporting ESP32
// Version: DAC Audio V4.2.1
// Last Update: Oct-22-2019
//
// Patches by TEB. Sept 16, 2019, Sep-29-2019, Oct-10-2019, Oct-21-2019, Oct-22-2019
// Updates:
//   Revised dacWrite() in ontimer() ISR to use inline code. This prevents crash during EEPROM writes.
//   Fixed FillBuffer() so that buffer size can be successfully changed.
//   Eliminated Pop click noise at start and stop of audio playback.
//   Fixed Intermittant garbled audio.
//   Revised pointer declarations to use cpp nullptr instead of NULL/zero.
//   Added ClearAfterPlay (Mod by Steve).
//   Fixed XT_Wav_Class and XT_Sequence_Class sub-volume controls.
//
// May work with other processors and/or DAC's with or without modifications
// (c) XTronical 2018, Licensed under GNU GPL 3.0 and later, under this license absolutely no warranty given
// See www.xtronical.com for documentation
// This software is currently under active development (Jan 2018) and may change and break your code with new versions
// No responsibility is taken for this. Stick with the version that works for you, if you need newer commands from later versions
// you may have to alter your original code

#include "esp32-hal-timer.h"
#include "DAC_Audio.h"
#include "HardwareSerial.h"
#include "soc/sens_reg.h"  // For dacWrite() patch, TEB Sep-16-2019



/*  Every variable that is used in the mainline code and in the onTImer interrupt code
 *	must be declared volatile.
 *	Also, variables used by onTimer must be regular variables and cannot be
 *	the CLASSES,because it is an interrupt routine and accessing variables
 *  belonging to objects was causing crashing in the ISR
 *  To avoid re-entrancy problems, the ISR onTimer() must change only the "play" index and the
 *	mainline code must change only the "fill" index.   Otherwise we can get corruption if
 *	onTimer() does a pull while FillBuffer() is putting data in.
 *	Each can _look_ at the other's variables, but both cannot _change_ the same variable.
 */

volatile int32_t NextPlayPos=0;							// position in buffer of next byte to play
volatile uint8_t *Buffer;								// The buffer to store the data that will be sent to the
volatile uint16_t BufferSize;							// Actual size if buffer used (default can be overridden in function call)
volatile uint8_t DacPin;                       			// pin to send DAC data to, presumably one of the DAC pins!
volatile uint8_t LastDacValue = 0x7f;				    // Last value sent to DAC, if next is same we don't write to DAC again
bool readySend = false;
XT_PlayListItem_Class *FirstPlayListItem=nullptr;       // first play list item to play in linked list. TEB, Oct-02-2019.
XT_PlayListItem_Class *LastPlayListItem=nullptr;        // last play list item to play in linked list. TEB, Oct-02-2019.

XT_Instrument_Class DEFAULT_INSTRUMENT;

int BufferUsed = 0;										// NB : Not working yet. Amount of bytes sent out to play since last buffer fill, this value
														// can help you determine an optimum buffer size if you don't want to
														// stick with the default set in BUFFER_SIZE_DEFAULT


// interrupt stuff
hw_timer_t * timer = nullptr;                           // TEB, Oct-10-2019
portMUX_TYPE timerMux = portMUX_INITIALIZER_UNLOCKED;


// The FNOTE "defines" below contain actual frequencies for notes which range from a few Hz (around 30) to around 4000Hz
// But in essence there are only 89 different notes , we collect them into an array so that we can store a note as
// a number from 0 to 90, (0 being no 0Hz, or silence). In this way we can store musical notes in single bytes.
// To benefit from this the music data in your code should be greater than 90 bytes otherwise your technically using more
// memory than you would if you used the raw frequencies (which use 2 bytes per note). It is estimated in simple projects you
// would not gain but generally a simple project would have more spare memory anyway. For larger projects where memory could
// be more of an issue you will actually save memory, so hopefully a win!
uint16_t XT_Notes[90]={1,FNOTE_B0,FNOTE_C1,FNOTE_CS1,FNOTE_D1,FNOTE_DS1,FNOTE_E1,FNOTE_F1,FNOTE_FS1,FNOTE_G1,FNOTE_GS1,FNOTE_A1,FNOTE_AS1,FNOTE_B1,FNOTE_C2,FNOTE_CS2,FNOTE_D2,FNOTE_DS2,FNOTE_E2,FNOTE_F2,FNOTE_FS2,FNOTE_G2,FNOTE_GS2,FNOTE_A2,FNOTE_AS2,FNOTE_B2,FNOTE_C3,FNOTE_CS3,FNOTE_D3,FNOTE_DS3,FNOTE_E3,FNOTE_F3,FNOTE_FS3,FNOTE_G3,FNOTE_GS3,FNOTE_A3,FNOTE_AS3,FNOTE_B3,FNOTE_C4,FNOTE_CS4,FNOTE_D4,FNOTE_DS4,FNOTE_E4,FNOTE_F4,FNOTE_FS4,FNOTE_G4,FNOTE_GS4,FNOTE_A4,FNOTE_AS4,FNOTE_B4,FNOTE_C5,FNOTE_CS5,FNOTE_D5,FNOTE_DS5,FNOTE_E5,FNOTE_F5,FNOTE_FS5,FNOTE_G5,FNOTE_GS5,FNOTE_A5,FNOTE_AS5,FNOTE_B5,FNOTE_C6,FNOTE_CS6,FNOTE_D6,FNOTE_DS6,FNOTE_E6,FNOTE_F6,FNOTE_FS6,FNOTE_G6,FNOTE_GS6,FNOTE_A6,FNOTE_AS6,FNOTE_B6,FNOTE_C7,FNOTE_CS7,FNOTE_D7,FNOTE_DS7,FNOTE_E7,FNOTE_F7,FNOTE_FS7,FNOTE_G7,FNOTE_GS7,FNOTE_A7,FNOTE_AS7,FNOTE_B7,FNOTE_C8,FNOTE_CS8,FNOTE_D8,FNOTE_DS8
};


// Precalculate sine values in an 8 bit range (i.e. usually 0 to 360Deg), we want a new measure of a Degree that
// defines a circle as 256 parts. We'll call these 8Bit Degrees!
// As we're using an 8 bit value for the DAC 0-255 (256 parts) that means for us
// there are 256 'bits' to a complete circle not 360 (as in degrees)

int SineValues[256];       // an array to store our values for sine

void InitSineValues()
{
	float ConversionFactor=(2.0*3.142)/256.0;           // convert my 0-255 bits in a circle to radians
														// there are 2 x PI radians in a circle hence the 2*PI
														// Then divide by 256 to get the value in radians
														// for one of my 0-255 bits.
	float RadAngle;                           			// Angle in Radians, have to have this as computers love radians!
	// calculate sine values
	for(int MyAngle=0;MyAngle<256;MyAngle++) {
		RadAngle=MyAngle*ConversionFactor;              // 8 bit angle converted to radians
		SineValues[MyAngle]=(sin(RadAngle)*127)+128;  	// get the sine of this angle and 'shift' up so
														// there are no negative values in the data
														// as the DAC does not understand them and would
														// convert to positive values.
	}
}





uint8_t SetVolume(uint8_t Value,uint8_t Volume)
{
	// returns the sound byte value adjusted for the volume passed, 0 min, 127 max
	// a value of 127 will not boost the sound higher than the original, it will
	// mean the value returned is the original, and any other value below 127 will
	// be a proportional fraction of the original
	// remember that the mid point ( no sound, speaker at rest) is 7f not 0

	uint8_t AdjustedValue;
	if(Volume>127)							// Max is 127
		Volume=127;
	if(Value==0x7f)
		return Value;  // a speaker at mid point, cannot change the volume of that, it is effectively 0
	if(Value>0x7f)
	{
		// +ve part of wave above 0, runs 1 to 128
		// value will actually be in range 128 to 255,
		AdjustedValue=Value-127;
		// Now adjust the volume be the ratio passed in
		AdjustedValue=AdjustedValue*(float(Volume)/127.0f);
		// finally put back in range 1 to 128
		return AdjustedValue+127;
	}
	// if we get this far then wave below 0, range 127 to 0 (127 being mid of wave, 0 nearest bottom(trough))
	// just flip the value so it's in range 1 to 127 with 1 being the low point
	AdjustedValue=0x7f-Value;
	// Then add in volume adjustment
	AdjustedValue=AdjustedValue*(float(Volume)/127.0f);
	// adjust back to correct range before returning
	return 0x7f-AdjustedValue;

