Derpythederp/3.007-DTI-Cube/proto_4/esp32_board1/DAC_Audio.cpp
}





// The main interrupt routine called "BytesPerSec" times per second (132300 BPS).
// WARNING: Do not use Arduino function dacWrite() in this isr. It will cause
// crash/reboot if EEPROM.commit() is used during the audio playback.
// The main interrupt routine called "BytesPerSec" times per second (132300 BPS).
// WARNING: Do not use Arduino function dacWrite() in this isr. It will cause
// crash/reboot if EEPROM.commit() is used during the audio playback.
void IRAM_ATTR onTimer()
{
  // Sound playing code, plays whatever's in the buffer continuously. Big change from previous versions
  if(LastDacValue!=Buffer[NextPlayPos])   // Send value to DAC only if changed since last value else no need
  {
    // value to DAC has changed, send to actual hardware, else we just leave setting as is as it's not changed
    LastDacValue=Buffer[NextPlayPos];

//    dacWrite(DacPin,LastDacValue);      // Don't use, will cause reboot during E2Prom writes. See emulation code below.

        // Start of dacWrite() emulation ...
        CLEAR_PERI_REG_MASK(SENS_SAR_DAC_CTRL1_REG, SENS_SW_TONE_EN);  //Disable Tone
        if(DacPin==25) {
//          pinMode(DacPin, ANALOG);  // Don't enable, will cause reboot during E2Prom writes. Pre-Set by dacWrite() in XT_DAC_Audio_Class init.
            CLEAR_PERI_REG_MASK(SENS_SAR_DAC_CTRL2_REG, SENS_DAC_CW_EN1_M);
            SET_PERI_REG_BITS(RTC_IO_PAD_DAC1_REG, RTC_IO_PDAC1_DAC, LastDacValue, RTC_IO_PDAC1_DAC_S);
            SET_PERI_REG_MASK(RTC_IO_PAD_DAC1_REG, RTC_IO_PDAC1_XPD_DAC | RTC_IO_PDAC1_DAC_XPD_FORCE);
        }
        else if(DacPin==26) {
//          pinMode(DacPin, ANALOG);   // Don't enable, will cause reboot during E2Prom writes. Pre-Set by dacWrite() in XT_DAC_Audio_Class init.
            CLEAR_PERI_REG_MASK(SENS_SAR_DAC_CTRL2_REG, SENS_DAC_CW_EN2_M);
            SET_PERI_REG_BITS(RTC_IO_PAD_DAC2_REG, RTC_IO_PDAC2_DAC, LastDacValue, RTC_IO_PDAC2_DAC_S);
            SET_PERI_REG_MASK(RTC_IO_PAD_DAC2_REG, RTC_IO_PDAC2_XPD_DAC | RTC_IO_PDAC2_DAC_XPD_FORCE);
        }
        // End of dacWrite() emulation.

  }
  Buffer[NextPlayPos]=0x7f;         // Set this buffer byte to silence, TEB Sep-23-2019.
  NextPlayPos++;                // Move play pos to next byte in buffer
  if(NextPlayPos >= BufferSize)       // If gone past end of buffer,
    NextPlayPos=0;              // set back to beginning
}


int XT_DAC_Audio_Class::BufferUsage()
{
   return BufferUsed;
}

void XT_DAC_Audio_Class::FillBuffer()
{
	// Fill the buffer, another routine that has changed almost completely since versions before 3.2
	// This is because of the requirement to mix sounds together so we can emit more than one at once
	// For each play item mix its next byte into the correct place in the buffer. Remember on a large
	// buffer the playing pos may be some distance from where the last sound is filling. Filling at
	// a position far ahead of the play pos would give an inaccurate and unknown mix effect
	// Note mixing always occurs even if just 1 sound being played as it will be effectively
	// mixed with the silence in the buffer.
	// To mix waves you add the waves together.... That is presuming they are "correct" waves
	// that have both positive and negative peaks and troughs. However these sounds produce
	// as 8bit unsigned value, i.e. everything above 0,
	// so therefore there is no negative, we need to adjust them back to having
	// correct positive and negative peaks and troughs first before doing the "mixing",
	// and then convert back to a wave with values 0 - 255.

	XT_PlayListItem_Class *PlayItem,*NextPlayItem;
	int16_t ByteToPlay,BufferByteToMixWith;							// Need 16 bit signed so we can have a range of
																	// -255 to +256
//	uint8_t NextByte,BufferByte;									// raw unsigned values of naext byte to plat and mix with
    uint8_t AudioVolume;                                            // Mod by TEB, Sep-15-2019
	uint8_t NextByte;
	uint32_t avail;													// # of bytes that we can put into the buffer.
	bool LogAvail=true;
	static uint16_t LastPlayPos=0;

	PlayItem=FirstPlayListItem;

	while(PlayItem!=nullptr)
	{
		if(PlayItem->NewSound)										// A new unplayed sound, set initial fill buffer position
		{
			PlayItem->NextFillPos=NextPlayPos+1;					// to one in front of actual playpos
			PlayItem->NewSound=false;								// No longer a new sound now.
			LogAvail=false;
		}

		avail = BufferSize- (PlayItem->NextFillPos - NextPlayPos); 	// Work out how much buffer we can fill
		if (avail >=BufferSize)										// This indicates the next fill pos was behind play pos,
			avail -= BufferSize;									//  bring into correct range
		if(LogAvail)												// calc how much of the play buffer was used since the
		{															// Last call to FillBuffer
			BufferUsed=NextPlayPos-LastPlayPos;
			if(BufferUsed<0)
				BufferUsed=BufferUsed+BufferSize;
		}
		while((PlayItem->Playing) && (avail > 0))					// while space in buffer and item still active.  TEB, Sep-29-2019.
		{
            avail--;
			NextByte = PlayItem->NextByte();							// Get next byte from this sound to play
			if(PlayItem->Filter!=0)
				NextByte=PlayItem->Filter->FilterWave(NextByte);	// Adjust the byte by any set filter, a Work in Progress

      // Convert bytes from unsigned int from 0-255 to a signed value from -127-128. 
      // Effectively transforms it to a sine wave that is centered around x axis.
			ByteToPlay=(NextByte-127);  							// -127 to make it's a wave that swings above and below 0
			BufferByteToMixWith=Buffer[PlayItem->NextFillPos]-127;  // -127 to make it's a wave that swings above and below 0

			ByteToPlay=BufferByteToMixWith+ByteToPlay;				// Mix them together and store back in ByteToPlay
     // Flatten the curve if it exceeds thresholds (>128 or <-127)
			if(ByteToPlay>128)
				ByteToPlay=128;										// Sound has topped out, adjust to max top out
			if(ByteToPlay<-127)
				ByteToPlay=-127;									// Sound has bottomed out, adjust to min bottom out

            AudioVolume = DacVolume;                                // Audio Volume patch by TEB, Sep-16-2019. 0=Off, 100=Full Volume.
            if(AudioVolume > 100) AudioVolume = 100;                // Constrain volume to 0-100%
            ByteToPlay = ByteToPlay * ((float)(AudioVolume)/100.0f);// Apply volume setting to dac data.

