Derpythederp/3.007-DTI-Cube/proto_4/esp32_board1/DAC_Audio.cpp
			Buffer[PlayItem->NextFillPos]=uint8_t(ByteToPlay+127);	// Store back in buffer adjusting so back in 0-255 range

			// Move the fill position for this sound item to next pos
			PlayItem->NextFillPos++;								// move to next buffer position
			if(PlayItem->NextFillPos>=BufferSize)					// Set to start of buffer if end reached
			   PlayItem->NextFillPos=0;

		}
    readySend = false;  // test correct position to slide this in to play once and stop
    
		NextPlayItem=PlayItem->NextItem;							// move to next play item
		if(PlayItem->Playing==false)								// If this play item completed
		{
			if(PlayItem->RepeatForever)
			{
				PlayItem->Init();						// initialise for playing again
				PlayItem->Playing=true;
			}
			else
			{
				if(PlayItem->RepeatIdx>0)				// Repeat sound X amount of times
				{
					PlayItem->RepeatIdx--;
					PlayItem->Init();						// initialise for playing again
					PlayItem->Playing=true;
				}
				else
					RemoveFromPlayList(PlayItem);		// no repeats, remove from play list
			}
		}
		PlayItem=NextPlayItem;										// Set to next item
	}
}


XT_PlayListItem_Class::XT_PlayListItem_Class()
{
	RepeatForever=false;
	Repeat=0;
	RepeatIdx=0;
}

// Despite being marked virtual and being overridden in desendents without these I get vtable error
// issues which I really don't understand, sl I put these in even though never called and all is well
uint8_t XT_PlayListItem_Class::NextByte()
{
	return 0;
}
void XT_PlayListItem_Class::Init()
{
}


XT_DAC_Audio_Class::XT_DAC_Audio_Class(uint8_t TheDacPin, uint8_t TimerNo):XT_DAC_Audio_Class(TheDacPin,TimerNo,BUFFER_SIZE_DEFAULT)
{
	// calls other constructor as shown in function definition
}


XT_DAC_Audio_Class::XT_DAC_Audio_Class(uint8_t TheDacPin, uint8_t TimerNo,uint16_t PassedBufferSize)
{
	// Using a prescaler of 80 gives a counting frequency of 1,000,000 (1MHz) and using
	// and calling the function every 20 counts of the frequency (the 20 below) means
	// that we will call our onTimer function 50,000 times a second

	// reserve some memory for the buffer
	Buffer=new uint8_t[PassedBufferSize];
	BufferSize=PassedBufferSize;					// Buffer Size is global var used in other routines that need to know size
	for(uint32_t i=0;i<PassedBufferSize;i++)		// Set all bytes in buffer to 0x7f (DAC silence), TEB Sep-23-2019
		Buffer[i]=0x7f;
	FirstPlayListItem=nullptr;                      // TEB, Oct-10-2019
	DacPin=TheDacPin;								// set dac pin to use
	LastDacValue=0x7F;								// set to mid point
	dacWrite(DacPin,LastDacValue);					// Set speaker to mid point, stops click at start of first sound
	InitSineValues();								// create our table of sine values for our special circular
													// angles of 0 - 255 "DAC Degrees". Speeds things up to if
													// you pre-calculate
	// Set up interrupt routine
	timer = timerBegin(TimerNo, 80, true);          // use timer TimerNo, pre-scaler is 80 (divide by 8000), count up
	timerAttachInterrupt(timer, &onTimer, true);    // P3= edge triggered
	timerAlarmWrite(timer, 20, true);               // will trigger 50,000 times per second,
	timerAlarmEnable(timer);                        // enable
	delay(1);                             			// Allow system to settle, otherwise garbage can play for first second

}


void XT_DAC_Audio_Class::PrintPlayList()
{
	// For debugging purposes, lists addresses of all items in playlist
    Serial.println("Current play list");
	XT_PlayListItem_Class *PlayItem = nullptr;  // TEB, Oct-10-2019
	PlayItem=FirstPlayListItem;
	while(PlayItem!=nullptr)                    // TEB, Oct-10-2019
	{
		Serial.print(PlayItem->Name);
		Serial.print(" @ ");
		Serial.print((unsigned long)PlayItem, HEX);
		PlayItem=PlayItem->NextItem;
		Serial.print("->");
	}
	Serial.println();

}


void XT_DAC_Audio_Class::RemoveFromPlayList(XT_PlayListItem_Class *ItemToRemove)
{
	// removes a play item from the play list
	if(ItemToRemove->PreviousItem!=nullptr)   // TEB, Oct-10-2019
		ItemToRemove->PreviousItem->NextItem=ItemToRemove->NextItem;
	else
		FirstPlayListItem=ItemToRemove->NextItem;
	if(ItemToRemove->NextItem!=nullptr)       // TEB, Oct-10-2019
		ItemToRemove->NextItem->PreviousItem=ItemToRemove->PreviousItem;
	else
		LastPlayListItem=ItemToRemove->PreviousItem;

	ItemToRemove->PreviousItem=nullptr;       // TEB, Oct-10-2019
	ItemToRemove->NextItem=nullptr;           // TEB, Oct-10-2019

}


void XT_DAC_Audio_Class::Play(XT_PlayListItem_Class *Sound)
{
	Play(Sound,true);				// Sounds mix by default
}


void XT_DAC_Audio_Class::Play(XT_PlayListItem_Class *Sound,bool Mix)
{

	// check if this sound is already playing, if so it is removed first and will be re-played
	// This limitation will be removed in later version so that multiple versions of the same
	// sound can be played at once. Trying to do that now will corrupt the list of items to play

	if(AlreadyPlaying(Sound))
		RemoveFromPlayList(Sound);
	if(Mix==false)  							// stop all currently playing sounds and just have this one
		StopAllSounds();

	Sound->NewSound=true;						// Flags to fill buffer routine that this is brand new sound
												// with nothing yet put into buffer for playing
	Sound->RepeatIdx=Sound->Repeat;				// Initialise any repeats

	// set up this sound to play, different types of sound may initialise differently
	Sound->Init();

	// add to list of currently playing items
	// create a new play list entry
	if(FirstPlayListItem==nullptr) // no items to play in list yet. TEB, Oct-10-2019
	{
		FirstPlayListItem=Sound;
		LastPlayListItem=Sound;
	}
	else{
		// add to end of list
		LastPlayListItem->NextItem=Sound;
		Sound->PreviousItem=LastPlayListItem;
		LastPlayListItem=Sound;

	}
	Sound->Playing=true;					// Will start it playing
}


bool XT_DAC_Audio_Class::AlreadyPlaying(XT_PlayListItem_Class *Item)
{
	// returns true if sound already in list of items to play else false
	XT_PlayListItem_Class* PlayItem;
	PlayItem=FirstPlayListItem;
	while(PlayItem!=nullptr)            // TEB, Oct-10-2019
	{
		if(PlayItem==Item)
			return true;
		PlayItem=PlayItem->NextItem;
	}
	return false;
}


void XT_DAC_Audio_Class::StopAllSounds()
{
	// stop all sounds and clear the play list

	XT_PlayListItem_Class* PlayItem;
	PlayItem=FirstPlayListItem;
	while(PlayItem!=nullptr)       // TEB, Oct-10-2019
	{
		PlayItem->Playing=false;
		RemoveFromPlayList(PlayItem);
		PlayItem=FirstPlayListItem;
	}
	FirstPlayListItem=nullptr;     // TEB, Oct-10-2019
}




// Wav Class functions

