Derpythederp/3.007-DTI-Cube/proto_4/esp32_board1/DAC_Audio.cpp
#define DATA_CHUNK_ID 0x61746164
#define FMT_CHUNK_ID 0x20746d66
// Convert 4 byte little-endian to a long.
#define longword(bfr, ofs) (bfr[ofs+3] << 24 | bfr[ofs+2] << 16 |bfr[ofs+1] << 8 |bfr[ofs+0])

XT_Wav_Class::XT_Wav_Class(const unsigned char *WavData)
{
   // create a new wav class object
   unsigned long ofs, siz;

   /* Process the chunks.  "fmt " is format, "data" is the samples, ignore all else. */
   ofs = 12;
   siz = longword(WavData, 4);
   SampleRate = DataStart = 0;
   while (ofs < siz) {
      if (longword(WavData, ofs) == DATA_CHUNK_ID) {
	 DataSize = longword(WavData, ofs+4);
	 DataIdx = DataStart = ofs +8;
      }
      if (longword(WavData, ofs) == FMT_CHUNK_ID) {
	 SampleRate = longword(WavData, ofs+12);
      }
      ofs += longword(WavData, ofs+4) + 8;
   }
   IncreaseBy=float(SampleRate)/BytesPerSec;
   PlayingTime = (1000 * DataSize) / (uint32_t)(SampleRate);
   Data=WavData;
   Speed=1.0;
}


void XT_Wav_Class::Init()
{
	LastIntCount=0;
	DataIdx=DataStart;
	Count=0;
	SpeedUpCount=0;
	TimeElapsed = 0;
	TimeLeft = PlayingTime;
}


uint8_t XT_Wav_Class::NextByte()
{
	// Returns the next byte to be played, note that this routine will return values suitable to
	// be played back at 50,000Hz. Even if this sample is at a lesser rate than that it will be
	// padded out as required so that it will appear to have a 50Khz sample rate


	uint32_t IntPartOfCount;
	uint8_t ReturnValue;
	float ActualIncreaseBy;

	// increase the counter, if it goes to a new integer digit then write to DAC

	ActualIncreaseBy=IncreaseBy;      // default if not playing slower than normal
	if(Speed<=1.0)	// manipulate IncreaseBy
		ActualIncreaseBy=IncreaseBy*Speed;
	Count+=ActualIncreaseBy;
	IntPartOfCount=floor(Count);
//	ReturnValue=Data[DataIdx];				// by default we return previous value;
    ReturnValue = SetVolume(Data[DataIdx], Volume);  // TEB, Oct-22-2019

	if(IntPartOfCount>LastIntCount)
	{
		if(Speed>1.0)
		{
			// for speeding up we need to basically go through the data quicker as upping the frequency
			// that this routine is called could put too much strain on the CPU.
			// First we subtract 1 from IncreaseBy as code below will handling the basic increment through
			// the data.

			// we now get the integer and decimal parts of this number and move the DataIdx on by "int" amount first
			double IntPartAsFloat,DecimalPart,TempSpeed;
			TempSpeed=Speed-1.0;
			DecimalPart=modf(TempSpeed,&IntPartAsFloat);
			DataIdx+=int(IntPartAsFloat);						// always increase by the integer part
			SpeedUpCount+=DecimalPart;
			// If SpeedUpCount >1 then add this extra "1" to the DataIdx too and subtract 1 from SpeedUpCount
			// This allows us "apparently" increment the DataIdx by a decimal amount

			if(SpeedUpCount>1)
			{
				DataIdx++;				// move another pos into data
				SpeedUpCount--;			// Take it off SpeedUpCount
			}
		}
		// gone to a new integer of count, we need to send a new value to the DAC next time
		// update the DataIDx counter
		LastIntCount=IntPartOfCount;
		DataIdx++;
		TimeElapsed = 1000 * DataIdx / SampleRate;
		TimeLeft = PlayingTime - TimeElapsed;
		if(DataIdx>=DataSize)  				// end of data, flag end
		{
			Count=0;						// reset frequency counter
			DataIdx=DataStart;				// reset data pointer back to beginning of WAV data
			Playing=false;  				// mark as completed
			TimeLeft = 0;
		}
	}

	return ReturnValue;

}







// Instrument class routines

XT_Instrument_Class::XT_Instrument_Class():XT_Instrument_Class(INSTRUMENT_PIANO,127)
{
	  // See main constructor routine for description of passed parameters
	  // and defaults
}


XT_Instrument_Class::XT_Instrument_Class(int16_t InstrumentID):XT_Instrument_Class(InstrumentID,127)
{
	  // See main constructor routine for description of passed parameters
	  // and defaults
}


XT_Instrument_Class::XT_Instrument_Class(int16_t InstrumentID, uint8_t Volume)
{
	// Volume : Volume of sound 0- 127 (max)
	this->Note=abs(NOTE_C4);					// default note
	this->SoundDuration=1000;					// default note length, ignored if using envelopes
	this->Duration=1000;						// default length of entire play action (i.e. after any decay) ignored if using envelopes
	this->Volume=Volume;
	SetInstrument(InstrumentID);				// The default

}


void XT_Instrument_Class::SetNote(int8_t Note)
{
	this->Note=abs(Note);
}


void XT_Instrument_Class::SetInstrument(uint16_t Instrument)
{
	// To create your new "permanent" instrument to the code, add a line here that calls its
	// set up routine and add this as a private function to the header file for the
	// Instrument class. Also add a suitable # define to the Instruments.h header file
	// in the instruments section.
	// Any envelopes and waveforms will have their memory cleared here, no need to worry!

	delete(FirstEnvelope);				// remove old envelope definition
	FirstEnvelope=nullptr;              // TEB, Oct-10-2019

	switch (Instrument)
	{
		case(INSTRUMENT_NONE) 			: SetDefaultInstrument();break;
		case(INSTRUMENT_PIANO)			: SetPianoInstrument();break;
		case(INSTRUMENT_HARPSICHORD)	: SetHarpsichordInstrument();break;
		case(INSTRUMENT_ORGAN)			: SetOrganInstrument();break;
		case(INSTRUMENT_SAXOPHONE)		: SetSaxophoneInstrument();break;

		default: // compilation error, default to just square wave
			SetDefaultInstrument();break;
	}
}


void XT_Instrument_Class::SetDefaultInstrument()
{
	SetWaveForm(WAVE_SQUARE);
}


void XT_Instrument_Class::SetPianoInstrument()
{
	SetWaveForm(WAVE_TRIANGLE);
	FirstEnvelope=new XT_Envelope_Class();
	FirstEnvelope->AddPart(25,127);
	FirstEnvelope->AddPart(20,20);
	FirstEnvelope->AddPart(15,75);
	FirstEnvelope->AddPart(10,15);
	FirstEnvelope->AddPart(5,50);
	FirstEnvelope->AddPart(300,0);
}

void XT_Instrument_Class::SetHarpsichordInstrument()
{
	SetWaveForm(WAVE_SAWTOOTH);
	FirstEnvelope=new XT_Envelope_Class();
	FirstEnvelope->AddPart(15,127);
	FirstEnvelope->AddPart(80,100);
	FirstEnvelope->AddPart(300,0);
}


void XT_Instrument_Class::SetOrganInstrument()
{
	SetWaveForm(WAVE_SINE);
	FirstEnvelope=new XT_Envelope_Class();
	FirstEnvelope->AddPart(15,127);
	FirstEnvelope->AddPart(3000,0);	// An organ maintains until key released
}



void XT_Instrument_Class::SetSaxophoneInstrument()
{
	SetWaveForm(WAVE_SQUARE);
	FirstEnvelope=new XT_Envelope_Class();
	FirstEnvelope->AddPart(15,127);
	FirstEnvelope->AddPart(3000,0);	// An organ maintains until key released
}


void XT_Instrument_Class::SetWaveForm(uint8_t WaveFormType)
{
	// Sets the wave form for this instrument

	delete (WaveForm);										// free any previous memory for a previous waveform
	switch (WaveFormType)
	{
		case WAVE_SQUARE : WaveForm=new XT_SquareWave_Class();break;
		case WAVE_TRIANGLE : WaveForm=new XT_TriangleWave_Class();break;
		case WAVE_SAWTOOTH : WaveForm=new XT_SawToothWave_Class();break;
		case WAVE_SINE : WaveForm=new XT_SineWave_Class();break;

		default: // compilation error, default to square
			WaveForm=new XT_SquareWave_Class();break;
	}
}

