Derpythederp/3.007-DTI-Cube/proto_4/esp32_board1/DAC_Audio.cpp
void XT_Instrument_Class::SetFrequency(uint16_t Freq)
{
	// only if not using note property
	Note=-1;
	WaveForm->Frequency=Freq;
	WaveForm->Init(-1);
}


void XT_Instrument_Class::Init()
{
	CurrentByte=0;
	WaveForm->Init(Note);
	// Note : These next two lines calculating the counters for the note duration are not used
	// if there are envelopes attached to this instrument, the timings of the envelopes taken
	// priority
	SoundDurationCounter=SoundDuration*50;
	DurationCounter=Duration*50;          // converts to how many samples to return before stopping
	if(FirstEnvelope!=nullptr)            // TEB, Oct-10-2019
	{
		CurrentEnvelope=FirstEnvelope;
		CurrentEnvelope->Init();

	}
}

uint8_t XT_Instrument_Class::NextByte()
{
	uint8_t ByteToPlay;

	// If no envelope then use normal duration settings
	if(CurrentEnvelope==nullptr)           // TEB, Oct-10-2019
	{
		if(DurationCounter==0)									// If completed mark as so and return no sound
		{
			Playing=false;
			return 0;
		}
		DurationCounter--;

		if(SoundDurationCounter==0)								// If sound completed return no sound
			return 0;
		SoundDurationCounter--;
	}

	if(WaveForm->Frequency==0)										// If no frequency then no sound
		return 0;

	// This next bit handles basic wave form if a sound is being produced

	ByteToPlay=WaveForm->NextByte();

	// Next add in envelope control if there is one
	if(CurrentEnvelope!=nullptr)                               // TEB, Oct-10-2019
	{
		ByteToPlay=CurrentEnvelope->NextByte(ByteToPlay);
		if(CurrentEnvelope->EnvelopeCompleted)
		{
			// check if another envelope in chain
			if(CurrentEnvelope->NextEnvelope!=nullptr)         // TEB, Oct-10-2019
			{
				CurrentEnvelope=CurrentEnvelope->NextEnvelope;
				CurrentEnvelope->Init();
			}
			else
			{
				Playing=false;		// All envelopes played
			}
		}
	}

	// adjust for current volume of this sound
	return SetVolume(ByteToPlay,Volume);
}


XT_Envelope_Class *XT_Instrument_Class::AddEnvelope()
{
	// Adds am envelope to this instrument, you will populate the envelope with it's parts
	// using the Envelope class AddPart function

	XT_Envelope_Class* Env=new XT_Envelope_Class();
	XT_Envelope_Class* ThisEnv,PreviousEnv;

	if(FirstEnvelope==nullptr)                // TEB, Oct-10-2019
	{
		// no envelopes at all yet, set to first and return
		FirstEnvelope=Env;
		return Env;
	}
	// find last envelope and add another to the chain
	ThisEnv=FirstEnvelope;
	while(ThisEnv->NextEnvelope!=nullptr)     // TEB, Oct-10-2019
		ThisEnv=ThisEnv->NextEnvelope;
	ThisEnv->NextEnvelope=Env;
	return Env;
}


void XT_Instrument_Class::SetDuration(uint32_t Length)			// in millis
{
	// If you are using a default instrument then this routine need not be set
	// will set duration of sound and duration that it plays to same value, i.e. when
	// sound physical sound ends the note is deemed finished
	SoundDuration=Length;
	Duration=Length;
}






//Music score class


// Hijack note: These two don't work as well with the ScoreLength in place, not guarantee it works without glitches.
//XT_MusicScore_Class::XT_MusicScore_Class(int8_t* Score):XT_MusicScore_Class(Score,TEMPO_ALLEGRO,&DEFAULT_INSTRUMENT)
//{
//	// set tempo and instrument to default, number of plays to 1 (once)
//}
//
//
//XT_MusicScore_Class::XT_MusicScore_Class(int8_t* Score,uint16_t Tempo):XT_MusicScore_Class(Score,Tempo,&DEFAULT_INSTRUMENT)
//{
//	// set instrument to default and plays to 1
//}


XT_MusicScore_Class::XT_MusicScore_Class(int8_t* Score,uint16_t Tempo,XT_Instrument_Class* Instrument, uint8_t ScoreLength)
{
	// Create music score
	this->Score=Score;
	this->Tempo=Tempo;
	this->Instrument=Instrument;
  this->ScoreLength=ScoreLength;
}


XT_MusicScore_Class::XT_MusicScore_Class(int8_t* Score,uint16_t Tempo,uint16_t InstrumentID, uint8_t ScoreLength)
{
	// Create music score
	this->Score=Score;
	this->Tempo=Tempo;
	this->Instrument=&DEFAULT_INSTRUMENT;
	Instrument->SetInstrument(InstrumentID);   // Change instrument from DEFAULT_INSTRUMENT to the other preset instruments
 // Add score length here also, since it is checked regardless
 this->ScoreLength=ScoreLength;
}

XT_MusicScore_Class::XT_MusicScore_Class(int8_t* Score,uint16_t Tempo,uint16_t InstrumentID, uint8_t ScoreLength , uint16_t MusicOffset, uint8_t NoteSkip)
{
  // Hijacked constructor
  // Create music score
  this->Score=Score;
  this->Tempo=Tempo;
  this->Instrument=&DEFAULT_INSTRUMENT;
  Instrument->SetInstrument(InstrumentID);   // Change instrument from DEFAULT_INSTRUMENT to the other preset instruments  
  this->ScoreIdx=MusicOffset;
  this->NoteSkip=NoteSkip;  // tbh NoteSkip is more of note increment
  this->ScoreLength=ScoreLength;
}


void XT_MusicScore_Class::Init()
{
	// Called before as score starts playing

	Instrument->Init(); // Initialise instrument

	// convert the tempo in BPM into a value that counts down in 50,000's of a second as this is the sample
	// rate sent to the DAC
	ChangeNoteEvery=(60/float(Tempo))*BytesPerSec;
	ChangeNoteCounter=0;					// ensures starts by playing first note with no delay
//	ScoreIdx=0;								// set position to first no, planning to replace
}

void XT_MusicScore_Class::sendNextNote() {
  // set the readySend flag
  // This method is to be called before fillbuffer in the loop()
  readySend = true;
}

uint8_t XT_MusicScore_Class::NextByte()
{
	// returns next byte for the DAC

  // Hijacking pseudocode
  // if (ChangeNoteCounter ==0) {if (readySend) { ... below code... until the return Instrument->NextByte} else return 0
  // Pressing button will let me call from the loop() sendNextNote() from XT_MusicScore_Class
  // But who unsets the readySend flag at the end of the note? And how?
  // The one who unsets the flag should be at the end of instrument or beat, that is when
  // ChangeNoteCounter==0, it should not just start playing a new note
  // The else i.e  ChangeNoteCounter--;   return Instrument->NextByte();
  // should not be covered


  // To skip note:
  // noteSkip=1 (by default), this means that play every note
  // noteSkip=2 means play every other note
  // ScoreIdx should be offsettable via constructor
  // Replace the ScoreIdx=0 in Init() 


  // Easiest is to replace ScoreIdx++ with ScoreIdx = ScoreIdx + noteSkip
  // So it will skip notes every call
  
  // How to check if ScoreIdx goes out of bounds (buffer overflow)?
  // Need feed in length of song also, as previously, SCORE_END was a guarantee hit so it was a reliable terminator, while now, it is not.
  // Add the following behind if((Score[ScoreIdx]==SCORE_END) || ScoreIdx > ScoreLength) {...}:

  // In summary:
  // Add NoteSkip, ScoreLength variable (Done)
  // SCORE_END is now obsolete in the notes (Removed --> Sync with the other)
  // Modify constructor such that it adjusts ScoreIdx (MusicOffset), takes in NoteSkip and ScoreLength
  // Modify all other overloads such that they function without breaking


  if (readySend) {
  	// are we ready to play another note?
  	if(ChangeNoteCounter==0)  {
  		// Yes, new note
      readySend = false;  // every new note, the readySend flag is unset so it stops playing
  		if(Score[ScoreIdx]==SCORE_END || (ScoreIdx > ScoreLength))  // end of data
  		{
  			Playing=false;
  			return 0;    	// return silence
  		}
  
