Derpythederp/3.007-DTI-Cube/proto_4/esp32_board1/DAC_Audio.cpp
  		Instrument->Note=abs(Score[ScoreIdx]);			// convert the negative value to positive index.
  		ScoreIdx++;										// move to next note
  
  		// set length of play for instrument
  		// Check next data value to see if it is a beat value
  		if(Score[ScoreIdx]>0) 							// positive value, therefore not default beat length
  		{
  			// Set the duration, beat value of 1=0.25 beat, 2 0.5 beat etc. So just divide by 4
  			// to get the real beat length,
  			Instrument->Duration=(ChangeNoteEvery*(float(Score[ScoreIdx])/4));
  			// Then times by 0.8 to allow for natural movement
  			// of players finger on the instrument.
  			Instrument->SoundDuration=Instrument->Duration*0.8;
  			ChangeNoteCounter=Instrument->Duration;      	// set back to start of count ready for next note
  			ScoreIdx = ScoreIdx + NoteSkip;										// point to next note, ready for next time
  		}
  		else
  		{
  			// default single beat values, all come with negative, so like -1, -2, -3, -4 
        // Note that beats don't have a skip value, let's see how that turns out
  			Instrument->Duration=ChangeNoteEvery;
  			Instrument->SoundDuration=Instrument->Duration*0.8;  	// By default a note plays for 80% of tempo
  																// this allows for the natural movement of the
  																// player performing the next note
  			ChangeNoteCounter=ChangeNoteEvery;              	// set back to start of count ready for next note
  		}
  		// Note that we do not call DacAudio.Play() here as it's already been done for this music score
  		// and it's this music score that effectively controls the note playing, however we still need
  		// to initialise the instrument for each new note played
  		Instrument->Init();
  	}
  	ChangeNoteCounter--;
  	// return the next byte for this instrument
  	return Instrument->NextByte();
  } else {  // modified check
    return 0;  // return silence
  }
}




void XT_MusicScore_Class::SetInstrument(uint16_t InstrumentID)
{
	Instrument->SetInstrument(InstrumentID);
}





// Envelope class, see www.xtronical.com for description of how to use envelopes with
// the instrument class

XT_Envelope_Class::XT_Envelope_Class()
{
	// nothing yet
}

XT_Envelope_Class::~XT_Envelope_Class()
{
	// delete any further linked envelopes and associated envelope parts for all envelopes found
	// Note if you delete from an envelope that it is not the start envelope then the previous
	// envelopes will still exist and in fact the last one before the one you delete will still
	// point to this one. If for some reason you wish to delete a none first envelope then you
	// must tidy up the last of the previous envelopes yourself.

	XT_EnvelopePart_Class* Part,*NextPart;

	if(NextEnvelope!=0)
		delete(NextEnvelope);				// if another envelope in the chain delete this also

	// delete the parts for this envelope
	Part=FirstPart;
	while(Part!=0)
	{
		NextPart=Part->NextPart;
		delete(Part);
		Part=NextPart;
	}
}


void XT_Envelope_Class::Init()
{
	// Reset envelope ready for next note to play
	CurrentEnvelopePart=0;
	EnvelopeCompleted=false;
	RepeatCounter=Repeats;
	DurationCounter=1;
}

uint8_t XT_Envelope_Class::NextByte(uint8_t ByteToPlay)
{
	// are their any parts, if not do nothing
	if(FirstPart!=0)
	{
		// OK we have some envelope parts, manipulate the wave form volume according to the
		// current envelope part in use for this instrument
		if(EnvelopeCompleted==false)
		{
			if(CurrentEnvelopePart==0)  				// start of envelope
			{
				CurrentEnvelopePart=FirstPart;
				InitEnvelopePart(CurrentEnvelopePart,CurrentVolume);
			}
			if(CurrentEnvelopePart->Completed)
			{
				CurrentEnvelopePart=CurrentEnvelopePart->NextPart;
				if(CurrentEnvelopePart==0)  // no more parts, do we need to repeat the envelope
				{
					if(RepeatCounter>0)
						RepeatCounter--;
					else
						EnvelopeCompleted=true;
				}
				else
					InitEnvelopePart(CurrentEnvelopePart,CurrentVolume);
			}
			if(CurrentEnvelopePart!=0)
			{
				CurrentVolume+=VolumeIncrement;
				ByteToPlay=SetVolume(ByteToPlay,int(CurrentVolume));
				DurationCounter--;
				if(DurationCounter==0)
					CurrentEnvelopePart->Completed=true;
			}
		}
	}
	return ByteToPlay;
}




void XT_Envelope_Class::InitEnvelopePart(XT_EnvelopePart_Class* EPart,uint8_t LastVolume)
{
	// initialises the properties in preparation to starting to use this envelope object
	// in note production

	if(EPart->StartVolume!=-1)					// do we have a start vol
		LastVolume=EPart->StartVolume;			// yes , set to this
	DurationCounter=EPart->RawDuration;
	// calculate how much the volume should increment per sample, this depends on what
	// the last volume reached was for the last envelope part, initially for the first
	// envelope part this would be 0. Volume is in the range 0-127
	VolumeIncrement=float((EPart->TargetVolume-LastVolume))/float(DurationCounter);
	CurrentVolume=LastVolume;
	EPart->Completed=false;
}



XT_EnvelopePart_Class* XT_Envelope_Class::AddPart(uint16_t Duration,uint16_t StartVolume,uint16_t TargetVolume)
{
	XT_EnvelopePart_Class* EPart;
	EPart=AddPart(Duration,TargetVolume);
	EPart->StartVolume=StartVolume;
	return EPart;
}



XT_EnvelopePart_Class* XT_Envelope_Class::AddPart(uint16_t Duration,uint16_t TargetVolume)
{
	// creates and adds an envelope part to this current envelope
	XT_EnvelopePart_Class* EPart=new XT_EnvelopePart_Class();

	EPart->SetDuration(Duration);
	EPart->TargetVolume=TargetVolume;
	if(FirstPart==0)											// First in list of envelope parts
	{
		FirstPart=EPart;
		LastPart=EPart;
	}
	else														// Add to end of list of envelope parts
	{
		LastPart->NextPart=EPart;
		LastPart=EPart;
	}
	return EPart;
}





// Envelope part class
void XT_EnvelopePart_Class::SetDuration(uint16_t Duration)
{
	this->Duration=Duration;
	this->RawDuration=50*Duration;
}

uint16_t XT_EnvelopePart_Class::GetDuration()
{
	return Duration;
}





// Wave type classes

// Square wave

uint8_t XT_SquareWave_Class::NextByte()
{
	// returns the next byte for this frequency of a square wave
	Counter--;
	if(Counter<0)
	{
		Counter+=CounterStartValue;				// as this can be a decimal, any amount extra below zero
												// is taken away from next starting value, in this way
												// for higher frequencies we do not lose as much
												// accuracy over a few waves, they average out to be
												// about right "on average"
		CurrentByte^=255;
		return CurrentByte;
	}
	else
		return CurrentByte;
}

void XT_SquareWave_Class::Init(int8_t Note)
{
	if(Note!=-1)								// use the note not a raw frequency
		Frequency=XT_Notes[Note];  				// if -1 then use the raw frequency
	if(Frequency>25000)
		Frequency=25000;
	if(Frequency!=0)							// avoid divide by 0, a freq of 0 means no sound
	{
		CounterStartValue=(25000/float(Frequency));
		Counter=CounterStartValue;
	}
	else
		Counter=0;
	ChangeAmplitudeBy=255;   					// amount to add on to change wave every time waveform needs changing
												// this value effectivly swaps the value from 0 to 255 and then 255 to 0
}





