Derpythederp/3.007-DTI-Cube/proto_4/esp32_board1/DAC_Audio.cpp
// Triangle wave functions
// Note that their

uint8_t XT_TriangleWave_Class::NextByte()
{
	// returns the next byte for this frequency of a square wave
	// called at the raw sample rate
	NextAmplitude+=ChangeAmplitudeBy;
	if(NextAmplitude>255)
	{	// top of a peak, reverse direction
		ChangeAmplitudeBy=-ChangeAmplitudeBy;    	// reverse direction
		NextAmplitude=255;
	}
	else
	{
		if(NextAmplitude<0)
		{	// bottom of a trough, reverse direction
			ChangeAmplitudeBy=-ChangeAmplitudeBy;    	// reverse direction
			NextAmplitude=0;
		}
	}
	return int(NextAmplitude);
}

void XT_TriangleWave_Class::Init(int8_t Note)
{
	NextAmplitude=127;
	if(Note!=-1)								// use the note not a raw frequency
		Frequency=XT_Notes[Note];  				// if -1 then use the raw frequency

	if(Frequency>25000)
		Frequency=25000;
	if(Frequency!=0)							// avoid divide by 0, a freq of 0 means no sound
	{
		ChangeAmplitudeBy=256/(25000/float(Frequency));// has to be 25K as has to ramp up and down to return to peak

	}
}




uint8_t XT_SawToothWave_Class::NextByte()
{
	// returns the next byte for this frequency of a square wave

	NextAmplitude+=ChangeAmplitudeBy;
	if(NextAmplitude>255)  // top of a peak, right down to bottom again
		NextAmplitude=0;
	return int(NextAmplitude);
}

void XT_SawToothWave_Class::Init(int8_t Note)
{
	NextAmplitude=0;
	if(Note!=-1)								// use the note not a raw frequency
		Frequency=XT_Notes[Note];  				// if -1 then use the raw frequency

	if(Frequency>25000)
		Frequency=25000;
	if(Frequency!=0)							// avoid divide by 0, a freq of 0 means no sound
		ChangeAmplitudeBy=256/(BytesPerSec/float(Frequency)); // determines amplitude change per sample
}






///////////////////////////////////////////////
uint8_t XT_SineWave_Class::NextByte()
{
	// returns the next byte for this frequency of a sine wave
	CurrentAngle+=AngleIncrement;
	if(CurrentAngle>255)
		CurrentAngle=0;							// Set to start
	return SineValues[int(CurrentAngle)];
}

void XT_SineWave_Class::Init(int8_t Note)
{
	CurrentAngle=0;
	if(Note!=-1)								// use the note not a raw frequency
		Frequency=XT_Notes[Note];  				// if -1 then use the raw frequency

	if(Frequency>25000)
		Frequency=25000;
	if(Frequency!=0)							// avoid divide by 0, a freq of 0 means no sound
		AngleIncrement=256/(BytesPerSec/float(Frequency));   // determines frequency
}



//////////////////////////////////////////////
void XT_Sequence_Class::Init()
{
	if(FirstItem!=nullptr)          // TEB, Oct-10-2019.
		CurrentItem=FirstItem;
	else
	{
		CurrentItem=nullptr;        // TEB, Oct-10-2019.
		return;
	}
	while(CurrentItem!=nullptr)     // TEB, Oct-10-2019.
	{
		CurrentItem->PlayItem->RepeatIdx=CurrentItem->PlayItem->Repeat;				// Initialise any repeats
		CurrentItem->PlayItem->Init();
		CurrentItem=CurrentItem->NextItem;
	}
	CurrentItem=FirstItem; 					// set back to start
	CurrentItem->PlayItem->Playing=true;	// mark as playing, init is called just prior to
											// first play

}


void XT_Sequence_Class::AddPlayItem(XT_PlayListItem_Class *PlayItem)
{
	// we copy the item so there are no conflicts with the item being played by the main Play routine
	// which also uses the linked lists and other properties of the play object etc. This will only
	// be a problem when we implement mixing of sounds.


	XT_SequenceItem_Class *SequenceItem;
	// create a new sequence item
	SequenceItem=new XT_SequenceItem_Class();
	SequenceItem->PlayItem=PlayItem;
	if(FirstItem==0) // no items to play in list yet
	{
		FirstItem=SequenceItem;
		LastItem=SequenceItem;
	}
	else
	{
		// add to end of list
		LastItem->NextItem=SequenceItem;
		LastItem=SequenceItem;
	}
}


void XT_Sequence_Class::RemoveAllPlayItems()
{
	// Remove all items in linked list and free associated memory

	XT_SequenceItem_Class *ThisItem,*NextItem;
	// Ensure not currently playing
	Playing=false;
	ThisItem=FirstItem;
	while(ThisItem!=nullptr)  // TEB, Oct-10-2019.
	{
		NextItem=ThisItem->NextItem;			// Get Next Item in list before removing this one
		delete(ThisItem);
		ThisItem=NextItem;
	}
	FirstItem=nullptr;   // TEB, Oct-10-2019.
	LastItem= nullptr;   // TEB, Oct-10-2019.
}


uint8_t XT_Sequence_Class::NextByte()
{
	if(CurrentItem == nullptr )     // TEB, Oct-10-2019.
		return 0;
	if(CurrentItem->PlayItem->Playing)
	//	return CurrentItem->PlayItem->NextByte();
        return SetVolume(CurrentItem->PlayItem->NextByte(), Volume);  // TEB, Oct-22-2019

	// If we get this far then the current item has stopped playing, time to play next
	// item if this one does not repeat, note RepeatForever is NOT ignored, as although
	// it would make no sense in most parts of a sequence as it would prevent any
	// more from playing, it does make sense if used on the last item where you may
	// want the last item to repeat forever, so it's up to the coder to not use
	// forever on anything but the last item

	// Check if set to play forever
	if(CurrentItem->PlayItem->RepeatForever)
	{
		CurrentItem->PlayItem->Init();
		CurrentItem->PlayItem->Playing=true;
	//	return CurrentItem->PlayItem->NextByte();
        return SetVolume(CurrentItem->PlayItem->NextByte(), Volume);  // TEB, Oct-22-2019
	}

	// check if any repeats
	if(CurrentItem->PlayItem->RepeatIdx>0)
	{
		CurrentItem->PlayItem->RepeatIdx--;			// decrement number left
		// repeat this item
		CurrentItem->PlayItem->Init();
		CurrentItem->PlayItem->Playing=true;
	//	return CurrentItem->PlayItem->NextByte();
        return SetVolume(CurrentItem->PlayItem->NextByte(), Volume);  // TEB, Oct-22-2019
	}
	// If got this far then current item stopped playing and no repeats, move to next item
	CurrentItem->PlayItem->Init();		// Init in case needed again. Steve, Oct-13-2019.
	CurrentItem=CurrentItem->NextItem;
	if(CurrentItem!=nullptr)
	{
		CurrentItem->PlayItem->Playing=true;
	//	return CurrentItem->PlayItem->NextByte();
        return SetVolume(CurrentItem->PlayItem->NextByte(), Volume);  // TEB, Oct-22-2019
	}
	else {
		Playing=false;					    // completed
        if(ClearAfterPlay && !RepeatForever)// Clear the Sequence list, Start Anew. Steve, Oct-21-2019.
			RemoveAllPlayItems();
    }

    return 0;  // Otherwise return "Silence" as default value. Added by TEB, Sep-15-2019.

}





// Filter class routines



XT_FilterNoise_Class::XT_FilterNoise_Class(int8_t AmountOfNoise)
{
	this->Min=-AmountOfNoise;
	this->Max=AmountOfNoise;
}


XT_FilterNoise_Class::XT_FilterNoise_Class(int8_t Min,int8_t Max)
{
	this->Min=Min;
	this->Max=Max;
}


uint8_t XT_FilterNoise_Class::FilterWave(uint8_t TheByte)
{
	// returns TheByte adjusted either up or down by a random amount, determined
	// by the min and max properties
	// using random gives the effect of noise

	int8_t TheRand=(rand()%((Max+1)-Min))+Min;
	int16_t TheResult=int16_t(TheByte)+int16_t(TheRand);

	if(TheResult>255)
		TheResult=255;
	else
		if(TheResult<0)
			TheResult=0;
	return uint8_t(TheResult);

}
